<%@ page contentType="text/html; charset=UTF-8" pageEncoding="UTF-8" %>
<html>
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link
            href="https://fonts.googleapis.com/css2?family=Roboto"
            rel="stylesheet"
    />
    <link
            href="https://fonts.googleapis.com/css2?family=Open Sans"
            rel="stylesheet"
    />
    <link
            href="assets/css/mainpage.css"
            rel="stylesheet"
    />
    <title>TATOO-Салон</title>
</head>
<body>
<div class="header-survival-background">
    <header>
        <div class="header-wildlife" display="inline">TATTOO-Салон</div>
        <ul>
            <li class="header-blog">
                <a href="ProjectServlet?command=to_catalog_page_command">Каталог</a>
            </li>
            <li class="header-contacts">
                <a href="">Заказы</a>
            </li>
            <li class="header-sign-in">
                <a href="ProjectServlet?command=to_login_page_command">Войти</a>
            </li>
        </ul>
    </header>
    <section class="survival">
        <h1 class="survival-tilte">Предложения</h1>
        <div class="survival-text">
            Одной из возможностей интарактива с клиентами данного сайта является
            возможность поделится своими идеями тату со всеми остальными.
            Если вы желаете предложить свою работу, просто нажмите "Предложить своё тату".
        </div>
        <button class="survival-donate">Предложить своё тату</button>
    </section>
</div>
<main class="main">
    <div class="main-background">
        <section class="latest-article">
            <div class="main-title1">Каталог</div>
            <div class="main-title2">Список первых доступных тату</div>
            <div class="main-grid-container">
                <div class="main-grid-item">
                </div>
                <div class="main-grid-item">
                </div>
                <div class="main-grid-item">
                </div>
                <div class="main-grid-item">
                </div>
                <div class="main-grid-item">
                </div>
                <div class="main-grid-item">
                </div>
                <div class="main-grid-item">
                </div>
                <div class="main-grid-item">
                </div>
            </div>
        </section>
        <section class="get-notified">
            <div class="main-title3">Просмотреть полный каталог тату</div>
            <button class="main-button">Каталог</button>
        </section>
    </div>
</main>
<footer class="footer">
    <div class="footer-background">
        <div class="footer-title">TATOO-Салон</div>
        <ul class="footer-info">
            <li class="footer-info-item">
                <a href="">Articles</a>
            </li>
            <li class="footer-info-item">
                <a href="">About us</a>
            </li>
            <li class="footer-info-item">
                <a href="">Learn more</a>
            </li>
        </ul>
        <ul class="footer-info-refs">
            <li class="footer-info-refs-item">
                <a href="">
                    <svg class="svg-icon" width="16" height="28" viewBox="0 0 16 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M10.6663 10.6663H15.6663V15.6663H10.6663V27.3325H5.66626V15.6663H0.66626V10.6663H5.66626V8.57501C5.66626 6.59376 6.29001 4.09001 7.53001 2.72126C8.77001 1.35001 10.3188 0.66626 12.1738 0.66626H15.6675V5.66626H12.1675C11.3375 5.66626 10.6675 6.33626 10.6675 7.16501V10.6663H10.6663Z" fill="#134731"/>
                    </svg>
                </a>
            </li>
            <li class="footer-info-refs-item">
                <a href="">
                    <svg class="svg-icon2" width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M15.0088 2.7017C19.019 2.7017 19.4938 2.71928 21.0709 2.78961C22.5366 2.85407 23.3281 3.10021 23.8558 3.30533C24.5534 3.57492 25.0576 3.90311 25.5794 4.42469C26.1071 4.95214 26.4295 5.45028 26.7051 6.14769C26.9103 6.67513 27.1565 7.47216 27.221 8.93143C27.2914 10.5138 27.309 10.9885 27.309 14.9912C27.309 18.9939 27.2914 19.4745 27.221 21.051C27.1565 22.5161 26.9103 23.3073 26.7051 23.8347C26.4354 24.5321 26.1071 25.0361 25.5853 25.5577C25.0576 26.0852 24.5593 26.4075 23.8616 26.6829C23.334 26.8881 22.5366 27.1342 21.0768 27.1987C19.4938 27.269 19.019 27.2866 15.0147 27.2866C11.0104 27.2866 10.5296 27.269 8.95251 27.1987C7.48681 27.1342 6.69533 26.8881 6.16768 26.6829C5.47 26.4134 4.9658 26.0852 4.44401 25.5636C3.91636 25.0361 3.5939 24.538 3.31835 23.8406C3.11315 23.3131 2.86691 22.5161 2.80242 21.0568C2.73207 19.4745 2.71448 18.9998 2.71448 14.9971C2.71448 10.9943 2.73207 10.5138 2.80242 8.93729C2.86691 7.47216 3.11315 6.68099 3.31835 6.15355C3.58804 5.45614 3.91636 4.95214 4.43815 4.43055C4.9658 3.90311 5.46414 3.58078 6.16181 3.30533C6.68947 3.10021 7.48681 2.85407 8.94665 2.78961C10.5237 2.71928 10.9986 2.7017 15.0088 2.7017ZM15.0088 0C10.9341 0 10.4241 0.0175816 8.82353 0.0879078C7.22884 0.158234 6.1325 0.416097 5.18272 0.78531C4.19191 1.1721 3.35353 1.68197 2.52101 2.52002C1.68263 3.35222 1.17256 4.19027 0.785617 5.17484C0.416259 6.1301 0.158296 7.22016 0.0879422 8.81422C0.0175884 10.42 0 10.9299 0 15.0029C0 19.076 0.0175884 19.5859 0.0879422 21.1858C0.158296 22.7798 0.416259 23.8758 0.785617 24.8252C1.17256 25.8156 1.68263 26.6536 2.52101 27.4858C3.35353 28.318 4.19191 28.8338 5.17686 29.2147C6.1325 29.5839 7.22298 29.8418 8.81767 29.9121C10.4182 29.9824 10.9283 30 15.0029 30C19.0776 30 19.5876 29.9824 21.1882 29.9121C22.7829 29.8418 23.8792 29.5839 24.829 29.2147C25.814 28.8338 26.6523 28.318 27.4849 27.4858C28.3174 26.6536 28.8333 25.8156 29.2144 24.831C29.5837 23.8758 29.8417 22.7857 29.9121 21.1916C29.9824 19.5917 30 19.0819 30 15.0088C30 10.9357 29.9824 10.4259 29.9121 8.82594C29.8417 7.23188 29.5837 6.13596 29.2144 5.18656C28.845 4.19027 28.335 3.35222 27.4966 2.52002C26.6641 1.68783 25.8257 1.1721 24.8407 0.79117C23.8851 0.421957 22.7946 0.164095 21.1999 0.0937683C19.5935 0.0175816 19.0834 0 15.0088 0V0Z" fill="#134731"/>
                    </svg>
                    <svg class="svg-icon3" width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M8.00879 0.296387C3.75239 0.296387 0.299194 3.74823 0.299194 8.00297C0.299194 12.2577 3.75239 15.7096 8.00879 15.7096C12.2652 15.7096 15.7184 12.2577 15.7184 8.00297C15.7184 3.74823 12.2652 0.296387 8.00879 0.296387ZM8.00879 13.002C5.24741 13.002 3.00781 10.7633 3.00781 8.00297C3.00781 5.24267 5.24741 3.00395 8.00879 3.00395C10.7702 3.00395 13.0098 5.24267 13.0098 8.00297C13.0098 10.7633 10.7702 13.002 8.00879 13.002Z" fill="#134731"/>
                    </svg>
                    <svg class="svg-icon4" width="4" height="4" viewBox="0 0 4 4" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M3.82315 1.99156C3.82315 2.98527 3.01737 3.79074 2.02327 3.79074C1.02917 3.79074 0.223389 2.98527 0.223389 1.99156C0.223389 0.997853 1.02917 0.192383 2.02327 0.192383C3.01737 0.192383 3.82315 0.997853 3.82315 1.99156Z" fill="#134731"/>
                    </svg>
                </a>
            </li>
            <li class="footer-info-refs-item">
                <a href="">
                    <svg class="svg-icon" width="21" height="27" viewBox="0 0 21 27" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M10.81 0.951172C3.75996 0.951172 0.204956 6.00617 0.204956 10.2212C0.204956 12.7762 1.17371 15.0449 3.24371 15.8899C3.58496 16.0299 3.88871 15.8962 3.98746 15.5212C4.05621 15.2599 4.21746 14.5999 4.29121 14.3262C4.39246 13.9574 4.35246 13.8262 4.07996 13.5012C3.48121 12.7974 3.09996 11.8812 3.09996 10.5899C3.09996 6.83992 5.90496 3.48367 10.4062 3.48367C14.3925 3.48367 16.5825 5.92242 16.5825 9.16992C16.5825 13.4499 14.6875 17.0599 11.8762 17.0599C10.3225 17.0599 9.16121 15.7762 9.53496 14.2012C9.98121 12.3174 10.845 10.2899 10.845 8.93492C10.845 7.71992 10.1912 6.70867 8.84496 6.70867C7.25871 6.70867 5.98121 8.34867 5.98121 10.5487C5.98121 11.9499 6.45746 12.8974 6.45746 12.8974C6.45746 12.8974 4.83121 19.7787 4.54746 20.9837C3.98121 23.3837 4.46246 26.3274 4.50621 26.6249C4.52746 26.7987 4.75496 26.8437 4.85621 26.7099C5.00246 26.5187 6.89496 24.1812 7.53496 21.8512C7.71996 21.1912 8.57996 17.7762 8.57996 17.7762C9.09871 18.7574 10.6012 19.6224 12.205 19.6224C16.9762 19.6224 20.2112 15.2762 20.2112 9.45117C20.2062 5.05117 16.4775 0.951172 10.8112 0.951172H10.81Z" fill="#134731"/>
                    </svg>
                </a>
            </li>
            <li class="footer-info-refs-item">
                <a href="">
                    <svg class="svg-icon5" width="26" height="23" viewBox="0 0 26 23" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M23.4299 0.755723L0.838079 9.93565C-0.0710467 10.3631 -0.378545 11.2193 0.618303 11.6839L6.41413 13.6246L20.4275 4.49886C21.1927 3.92594 21.976 4.07873 21.302 4.70893L9.26632 16.1918L8.88824 21.0513C9.23843 21.8016 9.87963 21.8051 10.2886 21.4322L13.6185 18.1122L19.3214 22.612C20.6459 23.4383 21.3666 22.905 21.6516 21.3906L25.3922 2.72707C25.7806 0.862859 25.1182 0.0414915 23.4299 0.755723Z" fill="#134731"/>
                    </svg>
                </a>
            </li>
        </ul>
    </div>
</footer>
</body>
</html>
